Public Attributes | List of all members
API_RailingSegmentQuantity Struct Reference
Element Manager
Calculated values for the railing segments. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | volume
Volume of the railing segment.
 double  | length3D
Length of the 3D reference line of the railing segment.
Detailed Description
Calculated values for the railing segments.